In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
!ls data

AMZN.csv           apply_demo.csv     iris.csv           top5.csv
BABA.csv           city_weather.csv   movie_metadata.csv train.csv
Pokemon.csv        demo_duplicate.csv sales-funnel.xlsx  usa_flights.csv

In [3]:
df = pd.read_csv('data/apply_demo.csv')

In [4]:
df.shape

(3989, 2)

In [5]:
df.head()

         time                                data
0  1473411962   Symbol: APPL Seqno: 0 Price: 1623
1  1473411962   Symbol: APPL Seqno: 0 Price: 1623
2  1473411963   Symbol: APPL Seqno: 0 Price: 1623
3  1473411963   Symbol: APPL Seqno: 0 Price: 1623
4  1473411963   Symbol: APPL Seqno: 1 Price: 1649

In [6]:
df['A'] = Series(['a']*3989)
df.head()

         time                                data  A
0  1473411962   Symbol: APPL Seqno: 0 Price: 1623  a
1  1473411962   Symbol: APPL Seqno: 0 Price: 1623  a
2  1473411963   Symbol: APPL Seqno: 0 Price: 1623  a
3  1473411963   Symbol: APPL Seqno: 0 Price: 1623  a
4  1473411963   Symbol: APPL Seqno: 1 Price: 1649  a

> 改变需求需要把a都改成A， 在原始数据上修改

In [8]:
df['A'] = df['A'].apply(str.upper)

In [9]:
df.head()

         time                                data  A
0  1473411962   Symbol: APPL Seqno: 0 Price: 1623  A
1  1473411962   Symbol: APPL Seqno: 0 Price: 1623  A
2  1473411963   Symbol: APPL Seqno: 0 Price: 1623  A
3  1473411963   Symbol: APPL Seqno: 0 Price: 1623  A
4  1473411963   Symbol: APPL Seqno: 1 Price: 1649  A

In [10]:
del df['A']

In [11]:
df.head()

         time                                data
0  1473411962   Symbol: APPL Seqno: 0 Price: 1623
1  1473411962   Symbol: APPL Seqno: 0 Price: 1623
2  1473411963   Symbol: APPL Seqno: 0 Price: 1623
3  1473411963   Symbol: APPL Seqno: 0 Price: 1623
4  1473411963   Symbol: APPL Seqno: 1 Price: 1649

> 切分数据

In [13]:
tmp = df['data'][0].strip().split(' ')

In [14]:
tmp

['Symbol:', 'APPL', 'Seqno:', '0', 'Price:', '1623']

In [15]:
tmp[1], tmp[3], tmp[5]

('APPL', '0', '1623')

In [16]:
# 自定义分割函数
def foo(line):
    line = line.strip().split(' ')
    return Series([line[1], line[3], line[5]])

In [19]:
df_tmp = df['data'].apply(foo)
df_tmp = df_tmp.rename(columns={0: 'Symbol', 1:'Seqno', 2:'Price'})
df_tmp.head()

  Symbol Seqno Price
0   APPL     0  1623
1   APPL     0  1623
2   APPL     0  1623
3   APPL     0  1623
4   APPL     1  1649

In [20]:
df.head()

         time                                data
0  1473411962   Symbol: APPL Seqno: 0 Price: 1623
1  1473411962   Symbol: APPL Seqno: 0 Price: 1623
2  1473411963   Symbol: APPL Seqno: 0 Price: 1623
3  1473411963   Symbol: APPL Seqno: 0 Price: 1623
4  1473411963   Symbol: APPL Seqno: 1 Price: 1649

In [21]:
df_new = df.combine_first(df_tmp)
df_new.head()

    Price  Seqno Symbol                                data        time
0  1623.0    0.0   APPL   Symbol: APPL Seqno: 0 Price: 1623  1473411962
1  1623.0    0.0   APPL   Symbol: APPL Seqno: 0 Price: 1623  1473411962
2  1623.0    0.0   APPL   Symbol: APPL Seqno: 0 Price: 1623  1473411963
3  1623.0    0.0   APPL   Symbol: APPL Seqno: 0 Price: 1623  1473411963
4  1649.0    1.0   APPL   Symbol: APPL Seqno: 1 Price: 1649  1473411963

In [22]:
del df_new['data']

In [23]:
df_new.head()

    Price  Seqno Symbol        time
0  1623.0    0.0   APPL  1473411962
1  1623.0    0.0   APPL  1473411962
2  1623.0    0.0   APPL  1473411963
3  1623.0    0.0   APPL  1473411963
4  1649.0    1.0   APPL  1473411963